/*  Даны две различные клетки шахматной доски, определите, может ли конь попасть с первой клетки на вторую одним ходом.
    Формат входных данных
    Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
    Формат выходных данных
    Программа должна вывести YES, если из первой клетки ходом коня можно попасть во вторую или NO в противном случае. 
*/

    #include <iostream>
    #include <cmath>
 
    using namespace std;
    
    int main() {
        int x1, x2, y1, y2 = 0;

        std::cout << "X1: ";
        std::cin >> x1;

        std::cout << "Y1: ";
        std::cin >> y1;

        std::cout << "X2: ";
        std::cin >> x2;

        std::cout << "Y2: ";
        std::cin >> y2;
        
        if (abs(x2-x1)==1 && abs(y2-y1)==2)
            cout << "YES\n";
        
        if (abs(x2-x1)==2 && abs(y2-y1)==1)
        {
            cout << "YES\n";
        }else{
            cout << "NO\n";
        }

        return 0;
    }