//{============================================================================
//! @brief	Главная страница системы помощи
//}============================================================================

/*! 	@mainpage Титульная страница
		@section 	MainPage 	TankLibuary
			$Version: 1.0.0 $ 
			$Date: 11.06.2020 $
			$Copyright: (C) Egor Zarubin (https://vk.com/egor.zarubin) $

		@section 	Contents 	Разделы системы помощи
             -  @ref MainPage	"Информация о библиотеке"
             -  @ref Drawning    "Отрисовка"
*/

//! @defgroup Drawning	Отрисовка

#include "TXlib.h"

//=================================================================================================================
//{          Tank
//! @name    Танк
//=================================================================================================================

//{----------------------------------------------------------------------------------------------------------------
//! @ingroup Drawning
//! @brief   Рисует "пиксельный" танк.
//!
//! @param   x   Принимает массив состоящий из значений всех точек танка по координате X
//!    (0-3 и 14-21  элементы массива-основной корпус танка в форме буквы "Н",при отрисовке элементы идут в таком порядке:0,1,15,14,17,16,2,3,20,21,18,19
//!    4-центральная точка танка(не учавствует в отрисовке),5-8-башня такнка,9-12-дуло танка,точка из которой вылетает снаряд(не учавствует в отрисовке).
//! @param   y 	Принимает массив состоящий из значений всех точек танка по координате Y.
//!    (0-3 и 14-21  элементы массива-основной корпус танка в форме буквы "Н",при отрисовке элементы идут в таком порядке:0,1,15,14,17,16,2,3,20,21,18,19
//!    4-центральная точка танка(не учавствует в отрисовке),5-8-башня такнка,9-12-дуло танка,точка из которой вылетает снаряд(не учавствует в отрисовке).
//! @param   MainColor Задает основной цвет такна.
//! @param   SideColor Задает цвет обводки такна.
//!
//! @return  Если операция была успешна -- true, иначе -- false.
//}----------------------------------------------------------------------------------------------------------------

    void DrawTank(double x[22], double y[22], COLORREF MainColor, COLORREF SideColor)
    {
        txSetColor(SideColor);
        txSetFillColor(MainColor);
        POINT Body[12]={{x[0],y[0]},{x[1],y[1]},{x[15],y[15]},{x[14],y[14]},{x[17],y[17]},{x[16],y[16]},{x[2],y[2]},{x[3],y[3]},{x[20],y[20]},{x[21],y[21]},{x[18],y[18]},{x[19],y[19]}};
        txPolygon(Body,12);
        txSetFillColor(MainColor);
        POINT Barrel[4]={{x[9],y[9]},{x[10],y[10]},{x[11],y[11]},{x[12],y[12]}};
        txPolygon(Barrel,4);
        POINT Tower[4]={{x[5],y[5]},{x[6],y[6]},{x[7],y[7]},{x[8],y[8]}};
        txPolygon(Tower,4);
        txSetColor(TX_WHITE);
        txSetFillColor(TX_WHITE);
    }

//{----------------------------------------------------------------------------------------------------------------
//! @ingroup Drawning
//! @brief   Рисует снаряд танка.
//!
//! @param   x   Значение центра снаряда по координате X.
//! @param   y 	 Значение центра снаряда по координате Y.
//!
//! @return  Если операция была успешна -- true, иначе -- false.
//}----------------------------------------------------------------------------------------------------------------

    void Bullet(int x, int y)
    {  
	    txSetColor(TX_BLACK);
        txCircle(x, y, 10);
    }

//! @}
//}
//=================================================================================================================